Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.c
	// (4) Page Program
	[16] = FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x12, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0xED),
	[17] = FLEXSPI_LUT_SEQ (kFLEXSPI_Command_RADDR_SDR,   kFLEXSPI_8PAD, 32,   kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_8PAD, 128),

	// (5) Block Erase 4K
	[20] = FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x21, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0xDE),
	[21] = FLEXSPI_LUT_SEQ (kFLEXSPI_Command_RADDR_SDR,   kFLEXSPI_8PAD, 32,   kFLEXSPI_Command_STOP,        kFLEXSPI_1PAD, 0),

	// (6) Chip Erase 
	[24] = FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x60, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x9F),

	// (8) Write Status/Control Registers
	[32] = FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x01, kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 0x04),

	// (9) Write Configuration Register 2
	[36] = FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x72, kFLEXSPI_Command_RADDR_SDR,   kFLEXSPI_1PAD, 32),
	[37] = FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 1,    kFLEXSPI_Command_STOP,        kFLEXSPI_1PAD, 0),
	[38] = 0
};


// Define the structure of the Flash (Sector Count and Size)
static libmem_geometry_t geometry[] =
{ // count - size
	{0x2000, 0x1000},
	{0, 0} 
};

static status_t ReadJEDEC           (FLEXSPI_Type *base, struct DeviceInfo *Info);
static status_t EnterQuadSPIMode    (FLEXSPI_Type *base, uint32_t baseAddr, enum LUT_CommandOffsets LutOffset);
static status_t WriteEnable         (FLEXSPI_Type *base, uint32_t baseAddr);
static status_t WaitBusBusy         (FLEXSPI_Type *base);
static status_t UnprotectAll_Adesto (FLEXSPI_Type *base);
static status_t WriteRegister       (FLEXSPI_Type *base, uint32_t Address, uint8_t value, enum LUT_CommandOffsets cmd);
static status_t EraseChip           (FLEXSPI_Type *base);
static int EraseSector              (libmem_driver_handle_t *h, libmem_sector_info_t *si);
static int ProgramPage              (libmem_driver_handle_t *h, uint8_t *dest_addr, const uint8_t *src_addr);


static int libmem_ProgramPage (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size);
static int libmem_EraseSector (libmem_driver_handle_t *h, uint8_t *start, size_t size, uint8_t **erase_start, size_t *erase_size);
static int libmem_Flush       (libmem_driver_handle_t *h);
static int libmem_Read        (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size);
static uint32_t libmem_CRC32  (libmem_driver_handle_t *h, const uint8_t *start, size_t size, uint32_t crc);


static const libmem_driver_functions_t DriverFunctions =
{
	libmem_ProgramPage,
	0,
	libmem_EraseSector,
	0,
	0,
	libmem_Flush
};

static const libmem_ext_driver_functions_t ext_driver_functions =
{
	0,
	libmem_Read,
	libmem_CRC32
};

#if defined FSL_FEATURE_SOC_CCM_ANALOG_COUNT && FSL_FEATURE_SOC_CCM_ANALOG_COUNT > 0
void SetClockConfig (FLEXSPI_Type *base, uint32_t div)
{
	switch ((uint32_t)base)
	{
		case FLEXSPI_BASE:
			CLOCK_EnableClock(kCLOCK_FlexSpi);
			CLOCK_SetMux     (kCLOCK_FlexspiMux, 0x2); // Choose PLL2 PFD2 clock as flexspi source clock.
			CLOCK_SetDiv     (kCLOCK_FlexspiDiv, div-1);
			break;
		#ifdef FLEXSPI2
		case FLEXSPI2_BASE:
			CLOCK_EnableClock(kCLOCK_FlexSpi2);
			CLOCK_SetMux     (kCLOCK_Flexspi2Mux, 0x0); // Choose PLL2 PFD2 clock as flexspi2 source clock.
			CLOCK_SetDiv     (kCLOCK_Flexspi2Div, div-1);
			break;
		#endif
		default:
			break;
	}
}
#endif


LibmemStatus_t Init_AdestoXiP (FLEXSPI_Type *base, enum eMemoryType MemType, const uint32_t **lut)
{
	DebugPrint ("Found Adesto Flash\r\n");
	// Unlock all sectors
	UnprotectAll_Adesto (base);

	// Switch the configuration according to the configured memory-type
	uint8_t Status = 0;
	switch (MemType)
	{
		case MemType_OctaSPI_DDR:
			// Enter Octal-Mode with DDR.
			Status = 0x88;
			*lut = LUT_OctaSPI_DDR_Adesto;
			break;
		case MemType_OctaSPI:
			Status = 0x08;
			*lut = LUT_OctaSPI_Adesto;
			break;
		case MemType_QuadSPI_DDR:
			Status = 0x84;
			*lut = LUT_QuadSPI_DDR_Adesto;
			break;
		case MemType_QuadSPI:
			Status = 0x04;
			*lut = LUT_QuadSPI;
			break;
		case MemType_SPI:
			// don't update the LUT, we are already in SPI-mode
			Status = 0x00;
			break;
		default:
			return LibmemStaus_Error;
	}

	// send write-enable 
	status_t stat = WriteEnable (base, 0);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;

	// Write to status/control register 2 to switch to chosen memory-Type
	stat = WriteRegister (base, 2, Status, LUT_WriteStatusReg_Adesto);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;

	stat = EnterQuadSPIMode (base, 0, LUT_EnterQPI);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;

	return LibmemStaus_Success;
}

LibmemStatus_t Init_Macronix (FLEXSPI_Type *base, enum eMemoryType MemType, const uint32_t **lut)
{
	DebugPrint ("Found Macronix Flash\r\n");
	uint8_t Status = 0;
	switch (MemType)
	{
		case MemType_OctaSPI_DDR:
			// Enter Octal-Mode with DDR.
			// DDR is not working. Fall back to SDR
//			Status = 2;
//			*lut = LUT_OctaSPI_DDR_Macronix;
//			break;
		case MemType_OctaSPI:
			Status = 1;
			*lut = LUT_OctaSPI_Macronix;
			break;
		case MemType_SPI:
			// don't update the LUT, we are already in SPI-mode
			Status = 0x00;
			break;
		default:
			return LibmemStaus_Error;
	}

	// SET Dummy Cycles
	// send write-enable 
	status_t stat = WriteEnable (base, 0);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;
	// Write to status/control register 2 to set the Dummy-Cycles
	stat = WriteRegister (base, 0x300, 12, LUT_WriteConfigReg_Macronix);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;
/*
	// Set Output inpedance
	// send write-enable 
	stat = WriteEnable (base, 0);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;
	// Write to status/control register 1 to switch to chosen memory-Type
	stat = WriteRegister (base, 0, 2, LUT_WriteConfigReg1_Macronix);	// 2 --> 52 Ohm. Compare "Output Driver Strength Table in the Reference manual"
	if (stat != kStatus_Success)
		return LibmemStaus_Error;*/

	// Switch to OSPI-Mode
	// send write-enable 
	stat = WriteEnable (base, 0);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;
	// Write to status/control register 2 to switch to chosen memory-Type
	stat = WriteRegister (base, 0, Status, LUT_WriteConfigReg_Macronix);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;

	return LibmemStaus_Success;
}

/** Libmem_InitializeDriver_xSPI:
Initialize the FlexSPI Interface for using as a SPI-Interface
@param FlashHandle The handle which should be initialized
@param base The Flex-SPI-base to use
@param MemType The Type of SPI-Interface to use if possible
@return LibmemStatus_t LibmemStaus_Success if the operation was successfully */
LibmemStatus_t Libmem_InitializeDriver_xSPI (libmem_driver_handle_t *FlashHandle, FLEXSPI_Type *base, enum eMemoryType MemType)
{
	#if (defined MIMXRT633S_SERIES) || defined (MIMXRT685S_cm33_SERIES) || defined (MIMXRT595S_cm33_SERIES)
		uint32_t src = 2;		// Use AUX0_PLL as clock source for the FlexSPI
		uint32_t FlexSPI_ClockDiv = 4;	// with a divider of four
		if (CLKCTL0->FLEXSPIFCLKSEL != CLKCTL0_FLEXSPIFCLKSEL_SEL(src) || (CLKCTL0->FLEXSPIFCLKDIV & CLKCTL0_FLEXSPIFCLKDIV_DIV_MASK) != (FlexSPI_ClockDiv - 1))
		{
			CLKCTL0->PSCCTL0_CLR = CLKCTL0_PSCCTL0_CLR_FLEXSPI_OTFAD_CLK_MASK;	// Disable clock before changing clock source
			CLKCTL0->FLEXSPIFCLKSEL = CLKCTL0_FLEXSPIFCLKSEL_SEL(src);			// Update flexspi clock.
			CLKCTL0->FLEXSPIFCLKDIV |= CLKCTL0_FLEXSPIFCLKDIV_RESET_MASK;		// Reset the divider counter
			CLKCTL0->FLEXSPIFCLKDIV = CLKCTL0_FLEXSPIFCLKDIV_DIV(FlexSPI_ClockDiv - 1);
			while ((CLKCTL0->FLEXSPIFCLKDIV) & CLKCTL0_FLEXSPIFCLKDIV_REQFLAG_MASK)
				;
			CLKCTL0->PSCCTL0_SET = CLKCTL0_PSCCTL0_SET_FLEXSPI_OTFAD_CLK_MASK;	// Enable FLEXSPI clock again
		}
		uint32_t FlexSPI_Clock_Hz = CLOCK_GetFlexspiClkFreq ();
		uint32_t SourceClock_Hz = FlexSPI_Clock_Hz * FlexSPI_ClockDiv;
	#elif ((defined MIMXRT1011_SERIES) || (defined MIMXRT1015_SERIES) || (defined MIMXRT1021_SERIES) || (defined MIMXRT1051_SERIES) || \
		   (defined MIMXRT1052_SERIES) || (defined MIMXRT1061_SERIES) || (defined MIMXRT1062_SERIES) || (defined MIMXRT1064_SERIES))
		// Set up source clock
		CLOCK_InitSysPfd (kCLOCK_Pfd2, 16);        // Set PLL2 PFD2 clock 594 MHZ.
		uint32_t SourceClock_Hz = CLOCK_GetSysPfdFreq (kCLOCK_Pfd2);

		uint32_t FlexSPI_ClockDiv = 6;
		uint32_t FlexSPI_Clock_Hz = SourceClock_Hz / FlexSPI_ClockDiv;
		SetClockConfig (base, FlexSPI_ClockDiv);	// flexspi clock 99 MHz.
	#else
		#error "unknon controller family"
	#endif
	deviceconfig.flexspiRootClk = FlexSPI_Clock_Hz;

	// Get FLEXSPI default settings and configure the FlexSPI.
	flexspi_config_t config = {0};
	FLEXSPI_GetDefaultConfig (&config);

	// Need to set the combination-enable option. This options combines 8 data lines from FlexSPI channel A with
	// 4 data lines from FlexSPI channel B to form an 8-line bus for octal. On this SoC this is the only way to enable octal.
	config.enableCombination              = (MemType == MemType_OctaSPI_DDR || MemType == MemType_OctaSPI);	// Only true when using Octa-Mode
	config.ahbConfig.enableAHBPrefetch    = true;	// Enable AHB prefetching
	config.ahbConfig.enableAHBBufferable  = true;
	config.ahbConfig.enableReadAddressOpt = true;
	config.ahbConfig.enableAHBCachable    = true;
	config.rxSampleClock = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;	// To achieve high speeds - always use DQS
	FLEXSPI_Init           (base, &config);
	FLEXSPI_SetFlashConfig (base, &deviceconfig, kFLEXSPI_PortA1);        // Configure flash settings according to serial flash feature.
	FLEXSPI_UpdateLUT      (base, 0, LUT_SPI_Generic, CUSTOM_LUT_LENGTH); // Update LUT table
	FLEXSPI_SoftwareReset  (base);                                        // Do software reset.


	// Get the JEDEC Informations
	struct DeviceInfo Info = {0};
	status_t status = ReadJEDEC (base, &Info);
	if (status != kStatus_Success)
	{
		DebugPrint ("JEDEC read Error\r\n");
		return LibmemStaus_InvalidDevice;
	}

	// Check for the Manufacture-ID and adapt the Configuration
	const uint32_t *lut = NULL;
	if (Info.ManufactureID == ManufactureID_AdestoTechnologies)
	{
		LibmemStatus_t res = Init_AdestoXiP (base, MemType, &lut);
		if (res != LibmemStaus_Success)
			return res;
	}
	else if (Info.ManufactureID == ManufactureID_Atmel)
	{
		DebugPrint ("Found Atmel Flash\r\n");
		if (Info.Type == 0xA8)
		{
			LibmemStatus_t res = Init_AdestoXiP (base, MemType, &lut);
			if (res != LibmemStaus_Success)
				return res;
		}
		else
		{
			status_t stat = EnterQuadSPIMode (base, 0, LUT_EnterQPI_Atmel);
			if (stat != kStatus_Success)
				return LibmemStaus_Error;
			lut = LUT_QuadSPI_3;
		}
	}
	else if (Info.ManufactureID == ManufactureID_Nexcom)	// Winbond
	{
		DebugPrint ("Found Nexcom Flash\r\n");
		// send write-enable 
		status_t stat = WriteEnable (base, 0);
		if (stat != kStatus_Success)
			return LibmemStaus_Error;

		// Write to status/control register 2 to switch to enter quad-Mode
		stat = WriteRegister (base, 0, 2, LUT_WriteConfigReg_Winbond);
		if (stat != kStatus_Success)
			return LibmemStaus_Error;

		lut = LUT_QuadSPI_3;
	}
	else if (Info.ManufactureID == ManufactureID_Macronix)
	{
		LibmemStatus_t res = Init_Macronix (base, MemType, &lut);
		if (res != LibmemStaus_Success)
			return res;
	}
	else if (Info.ManufactureID == ManufactureID_Lucent)
	{
		DebugPrint ("Found Lucent Flash\r\n");
		status_t stat = EnterQuadSPIMode (base, 0, LUT_EnterQPI_ISSI);
		if (stat != kStatus_Success)
			return LibmemStaus_Error;

		lut = LUT_QuadSPI_ISSI;
	}
	else
	{
		DebugPrint ("unknown Flash-memory\r\n");
		return LibmemStaus_InvalidDevice;
	}

	// Use the size information from the JEDEC-Information to configure the Interface
	uint32_t FlashSize = CalculateCapacity_KBytes (Info.Capacity);
	deviceconfig.flashSize = FlashSize;
	geometry[0].count = FlashSize / (4096 / 1024);
	FlashSize *= 1024;	// Convert kBytes to bytes
	FLEXSPI_SetFlashConfig (base, &deviceconfig, kFLEXSPI_PortA1);	// Configure flash settings according to serial flash feature.

	// Reconfigure the Interface according to the gathered Flash-Information and configuration
	if (MemType == MemType_OctaSPI_DDR || MemType == MemType_QuadSPI_DDR)
	{
		FlexSPI_ClockDiv = 3;	// ~Double the Frequency in DDR-Mode
		FlexSPI_Clock_Hz = SourceClock_Hz / FlexSPI_ClockDiv;
		deviceconfig.flexspiRootClk = FlexSPI_Clock_Hz;
		SetClockConfig (base, FlexSPI_ClockDiv); // Divide source clock the source/root ratio // Divide source clock the source/root ratio --> 148,5 Mhz
	}

	if (lut != NULL)
		// Update the LUT
		FLEXSPI_UpdateLUT (base, 0, lut, CUSTOM_LUT_LENGTH);

