Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.c
	FLEXSPI_SoftwareReset (base);
	status_t stat = WaitBusBusy (base);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;


	static uint8_t write_buffer[QSPIFLASH_PAGE_SIZE];
//	libmem_register_driver (FlashHandle, (uint8_t *)libmem_GetBaseAddress(base), FlashSize, geometry, 0, &DriverFunctions, &DriverFunctions_Extended);
	libmem_register_driver (FlashHandle, (uint8_t *)libmem_GetBaseAddress(base), FlashSize, geometry, 0, &DriverFunctions, NULL);
	FlashHandle->user_data = (uint32_t)base;
	return libmem_driver_paged_write_init (&paged_write_ctrlblk, write_buffer, QSPIFLASH_PAGE_SIZE, ProgramPage, 4, LIBMEM_DRIVER_PAGED_WRITE_OPTION_DISABLE_PAGE_PRELOAD);
}


static status_t UnprotectAll_Adesto (FLEXSPI_Type *base)
{
	status_t stat = WriteEnable (base, 0);
	if (stat != kStatus_Success)
		return stat;

	// write 0 to status/control register 1 - this will unprotect all sectors
	stat = WriteRegister (base, 1, 0, LUT_WriteStatusReg_Adesto);
	if (stat != kStatus_Success)
		return stat;

	return WaitBusBusy (base);
}

/** ReadJEDEC
Read the JEDEC Device informations
@param base The Flex-SPI-base to use
@param Info The read Device informations from the flash memory
@return status_t Status of the Operation - kStatus_Success when successfully */
static status_t ReadJEDEC (FLEXSPI_Type *base, struct DeviceInfo *Info)
{
	uint8_t Identification[16] = { 0U };

	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = 0;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Read;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_ReadJEDEC_ID;
	flashXfer.data          = (uint32_t *)Identification;
	flashXfer.dataSize      = sizeof(Identification);

	status_t status = FLEXSPI_TransferBlocking (base, &flashXfer);
	if (status != kStatus_Success)
		return status;

	if (Identification[0] == 0 || Identification[0] == 0xFF)
		return kStatus_Fail;	// got no ID-Code: No Flash available

	int i=0;
	for (; i<8; i++)
	{
		if (Identification[i] != ManufactureID_NEXT_MARKER)
			break;
	}

	Info->ManufactureID = (enum SerialFlash_ManufactureID)(((i+1)<<8) | Identification[i]);
	Info->Type          = Identification[i+1];
	Info->Capacity      = (enum Capacity)Identification[i+2];
	switch (Info->ManufactureID)
	{
		case ManufactureID_AdestoTechnologies:
			switch (Info->Type & 0x1F)
			{
				case 0x06:
					Info->Capacity = Capacity_16MBit;
					break;
				case 0x07:
					Info->Capacity = Capacity_32MBit;
					break;
				case 0x08:
					Info->Capacity = Capacity_64MBit;
					break;
				case 0x09:
					Info->Capacity = Capacity_128MBit;
					break;
			}
			break;
		case ManufactureID_Macronix:
			Info->Capacity = (enum Capacity)(Identification[i+2] & 0x1F);
			break;
		case ManufactureID_Atmel:
			switch (Info->Type)
			{
				case  0x89:	// AT25SF128A
					Info->Capacity = Capacity_128MBit;
					break;
				case  0xA8:	// ATXP064
					Info->Capacity = Capacity_64MBit;
					break;
			}
			break;
		default:
			break;
	}

	return status;
}

/** WriteEnable:
Send write-enable command
@param base The Flex-SPI-base to use
@param baseAddr The base-address of the command
@return static status_t */
static status_t WriteEnable (FLEXSPI_Type *base, uint32_t baseAddr)
{
	flexspi_transfer_t flashXfer;

	// Write enable
	flashXfer.deviceAddress = baseAddr;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_WriteEnable;
	status_t status = FLEXSPI_TransferBlocking (base, &flashXfer);

	return status;
}

static status_t EnterQuadSPIMode (FLEXSPI_Type *base, uint32_t baseAddr, enum LUT_CommandOffsets LutOffset)
{
	flexspi_transfer_t flashXfer;

	// Write enable
	flashXfer.deviceAddress = baseAddr;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LutOffset;
	status_t status = FLEXSPI_TransferBlocking (base, &flashXfer);

	return status;
}


/** WaitBusBusy:
Wait until the Write/erase operation is finished and the Flash is not busy anymore
@param base The Flex-SPI-base to use
@return status_t kStatus_Success if the operation was successfully */
static status_t WaitBusBusy (FLEXSPI_Type *base)
{
	// Wait status ready.
	bool isBusy;
	uint32_t readValue;
	status_t status;

	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = 0;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Read;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_ReadStatus;
	flashXfer.data          = &readValue;
	flashXfer.dataSize      = 1;

	do
	{
		status = FLEXSPI_TransferBlocking (base, &flashXfer);

		if (status != kStatus_Success)
			return status;

		isBusy = (readValue & 1U);
	}
	while (isBusy);

	return status;
}


static status_t WriteRegister (FLEXSPI_Type *base, uint32_t Address, uint8_t value, enum LUT_CommandOffsets cmd)
{
	uint32_t Buffer = value;

	flexspi_transfer_t flashXfer;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Write;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = cmd;
	flashXfer.deviceAddress = Address;
	flashXfer.data          = &Buffer;
	flashXfer.dataSize      = 1;
	return FLEXSPI_TransferBlocking (base, &flashXfer);
}

static status_t ReadStatusRegister (FLEXSPI_Type *base, uint8_t Address, uint8_t *value)
{
	flexspi_transfer_t flashXfer;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Read;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_ReadStatus;
	flashXfer.deviceAddress = Address;
	flashXfer.data          = (uint32_t *)value;
	flashXfer.dataSize      = 1;
	return FLEXSPI_TransferBlocking (base, &flashXfer);
}


/** EraseChip:
Erase the whole-Flash-memory
@param base The FlexSPI-Interface where the Flash is located which should be erased
@return static status_t Status of the Operation - kStatus_Success when successfully */
static status_t EraseChip (FLEXSPI_Type *base)
{
	status_t stat = WriteEnable (base, 0);
	if (stat != kStatus_Success)
		return stat;

	flexspi_transfer_t flashXfer;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.SeqNumber     = 1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.seqIndex      = LUT_EraseChip;
	flashXfer.deviceAddress = 0;
	//flashXfer.data = &flash_status;
	//flashXfer.dataSize = 1;
	stat = FLEXSPI_TransferBlocking (base, &flashXfer);
	if (stat != kStatus_Success)
		return stat;

	return WaitBusBusy (base);
}

/** EraseSector:
Erase a sector of the Flash-Memory
@param h Handle to the Flash-Driver
@param si Information about the sector which should be erased
@return static int LibmemStaus_Success when the erase operation was successfully, otherwise LibmemStaus_Error */
static int EraseSector (libmem_driver_handle_t *h, libmem_sector_info_t *si)
{
	FLEXSPI_Type *base = (FLEXSPI_Type *)h->user_data;
	uint32_t SectorAddr = libmem_CalculateOffset (base, (uint32_t)si->start);
	if (SectorAddr == UINT32_MAX)
		return LibmemStaus_Error;

	DebugPrintf ("EraseSector at 0x%x, size: %d\r\n", SectorAddr, si->size);

	status_t status = WriteEnable (base, SectorAddr);
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = SectorAddr;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Command;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_EraseSector;
	status = FLEXSPI_TransferBlocking (base, &flashXfer);

	if (status != kStatus_Success)
		return LibmemStaus_Error;

	status = WaitBusBusy (base);
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	return LibmemStaus_Success;
}

/** ProgramPage:
Write Data to a Flash-Page
@param h Handle to the Flash-Driver
@param Destination Address to write the Data to. This Address is in the Address-Range of the Controller
@param Source Address of the Array with the Data to write
@return static int LibmemStaus_Success when the write operation was successfully, otherwise LibmemStaus_Error */
static int ProgramPage (libmem_driver_handle_t *h, uint8_t *dest_addr, const uint8_t *src_addr)
{
	FLEXSPI_Type *base = (FLEXSPI_Type *)h->user_data;
	uint32_t DeviceAddress = libmem_CalculateOffset (base, (uint32_t)dest_addr);
	if (DeviceAddress == UINT32_MAX)
		return LibmemStaus_Error;

	DebugPrintf ("ProgramPage at 0x%X\r\n", DeviceAddress);

	// Write enable
	status_t status = WriteEnable (base, DeviceAddress);
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	// Prepare page program command
	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = DeviceAddress;
	flashXfer.port          = kFLEXSPI_PortA1;
	flashXfer.cmdType       = kFLEXSPI_Write;
	flashXfer.SeqNumber     = 1;
	flashXfer.seqIndex      = LUT_ProgramPage;
	flashXfer.data          = (uint32_t *)src_addr;
	flashXfer.dataSize      = QSPIFLASH_PAGE_SIZE;
	status = FLEXSPI_TransferBlocking (base, &flashXfer);
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	status = WaitBusBusy (base);
	if (status != kStatus_Success)
		return LibmemStaus_Error;

	return LibmemStaus_Success;
}

/** libmem_ProgramPage:
The LIBMEM driver's write function.
@param h    A pointer to the handle of the LIBMEM driver.
@param dest A pointer to the memory address in memory range handled by driver to write data to.
@param src  pointer to the memory address to read data from.
@param size The number of bytes to write.
@return int The LIBMEM status result */
static int libmem_ProgramPage (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
{
	return libmem_driver_paged_write (h, dest, src, size, &paged_write_ctrlblk);
}

/** libmem_EraseSector:
The LIBMEM driver's erase function
@param h           A pointer to the handle of the LIBMEM driver.
@param start       A pointer to the initial memory address in memory range handled by driver to erase.
@param size        The number of bytes to erase.
@param erase_start A pointer to a location in memory to store a pointer to the start of the memory range that has actually been erased or NULL if not required.
@param erase_size  A pointer to a location in memory to store the size in bytes of the memory range that has actually been erased or NULL if not required.
@return int        The LIBMEM status result */
static int libmem_EraseSector (libmem_driver_handle_t *h, uint8_t *start, size_t size, uint8_t **erase_start, size_t *erase_size)
{
	return libmem_foreach_sector_in_range (h, start, size, EraseSector, erase_start, erase_size);
}

/** libmem_Flush:
The LIBMEM driver's flush function.
@param h    A pointer to the handle of the LIBMEM driver. 
@return int The LIBMEM status result */
static int libmem_Flush (libmem_driver_handle_t *h)
{
	int res = libmem_driver_paged_write_flush (h, &paged_write_ctrlblk);
	return res;
}

/** libmem_Read:
The LIBMEM driver's read extended function.
@param h    A pointer to the handle of the LIBMEM driver.
@param dest A pointer to the initial memory address to write data to.
@param src  A pointer to the initial memory address in the memory range handled by the driver to read data from.
@param size The number of bytes to write.
@return int The LIBMEM status result */
static int libmem_Read (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size)
{
	(void)h;
	if (size)
		memcpy (dest, src, size);
	return LibmemStaus_Success;
}

/** libmem_CRC32:
The LIBMEM driver's crc32 extended function.
@param h     A pointer to the handle of the LIBMEM driver.
@param start A pointer to the start of the address range.
@param size  The size of the address range in bytes.
@param crc   The initial CRC-32 value.
@return uint32_t The computed CRC-32 value. */
static uint32_t libmem_CRC32 (libmem_driver_handle_t *h, const uint8_t *start, size_t size, uint32_t crc)
{
	(void)h;
	crc = libmem_crc32_direct (start, size, crc);
	return crc;
}


